import sys
input = sys.stdin.readline

n = int(input())

dp = [[0 for i in range(10)] for j in range(n+1)]

# 1의 자리수 초기화
for x in range(10):
  dp[1][x] = 1
  
for i in range(2, n+1): # i번째 자리수
  for k in range(10): # 0~9
    temp = 0
    for s in range(0, k+1): # i-1자리 수에서 0~k까지 더하기
      temp += dp[i-1][s]
    dp[i][k] = temp

result = 0
for i in range(10):
  result += dp[n][i]
print(result)

#수는 0으로 시작할 수 있다. (조건)
#     0 1 2 3 4 5 6 7 8 9 
#1    1 1 1 1 1 1 1 1 1 1
#2    1 2 3 4 5 6 7 8 9 10
#3    1 3 6 10 15 21 28 37 47

# => 규칙 : n자리 수에서 k로 끝나는 수의 개수 = n-1자리 수에서 0~k까지 더하기
# ######2자리
# 00 = 1

# 01 11 = 2

# 02 12 22 = 3
# .
# .
# .
# .
# ######3자리
# 000 = 1

# 001 011 = 1 + 2
# 111

# 002 012 022 = 1 + 2 + 3
# 112 122
# 222

# 003 013 023 033 = 1 + 2 + 3 + 4
# 113 123 133
# 223 233
# 333

# 004 014 024 034 044 = 1 + 2 + 3 + 4 + 5
# 114 124 134 144
# 224 234 244
# 334 344
# 444

# .
# .
# .
# .

# ####4자리

# 0004 0014 0024 0034 0044 
# 0114 0124 0134 0144
# 0224 0234 0244
# 0334 0344
# 0444

# 1114 1124 1134 1144
# 1224 1234 1244
# 1334 1344
# 1444

# .
# .
# .